#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repositories["test-app-repo"].github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repositories["test-app-repo"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Test application repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-app-repo"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # module.team_permissions["TestEngineering-test-app-repo"].github_team_repository.access will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test-app-repo"
      + team_id    = (known after apply)
    }

  # module.team_permissions["TestSecurity-test-app-repo"].github_team_repository.access will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "pull"
      + repository = "test-app-repo"
      + team_id    = (known after apply)
    }

  # module.teams["TestEngineering"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "Team synced from EntraID group TestEngineering"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "GH-TestEngineering"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.teams["TestPlatform"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "Team synced from EntraID group TestPlatform"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "GH-TestPlatform"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.teams["TestSecurity"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "Team synced from EntraID group TestSecurity"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "GH-TestSecurity"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + external_groups_status      = {}
  + repositories_created        = {
      + test-app-repo = {
          + name = "test-app-repo"
          + url  = (known after apply)
        }
    }
  + team_repository_assignments = {
      + TestEngineering-test-app-repo = {
          + permission = "push"
          + repository = "test-app-repo"
          + team       = "TestEngineering"
        }
      + TestSecurity-test-app-repo    = {
          + permission = "pull"
          + repository = "test-app-repo"
          + team       = "TestSecurity"
        }
    }
  + teams_created               = {
      + TestEngineering = {
          + id   = (known after apply)
          + slug = (known after apply)
          + url  = (known after apply)
        }
      + TestPlatform    = {
          + id   = (known after apply)
          + slug = (known after apply)
          + url  = (known after apply)
        }
      + TestSecurity    = {
          + id   = (known after apply)
          + slug = (known after apply)
          + url  = (known after apply)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Triggered by:** @jaimeaznar
**Test Mode:** Yes